---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalysisDisplayDiagramSettings Properties
AnalysisDisplayDiagramSettings Class See Also Send Feedback
---

The AnalysisDisplayDiagramSettings type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | FenceType | Type of diagram fence visualization. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OutlineColor | Color of outline and fence lines in the diagram. |
|  | OutlineLineWeight | Line weight of outline and fence lines in the diagram. |
|  | Rounding | Increment to which numeric values of analysis results are rounded in diagram. |
|  | TextLabelType | Type of diagram text label visualization. |
|  | TextTypeId | Element id of text associated with the settings. |
|  | Transparency | Transparency percentage of diagram color fill |

# See Also

AnalysisDisplayDiagramSettings Class

Autodesk.Revit.DB.Analysis Namespace